; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-8-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-2 - location
	p0-4 - location
	p0-5 - location
	p1-2 - location
	p1-4 - location
	p1-6 - location
	p3-1 - location
	p3-6 - location
	p3-7 - location
	p4-3 - location
	p4-8 - location
	p7-1 - location
	p7-2 - location
	p8-0 - location
	p8-2 - location
	p8-3 - location
	p8-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s6)
	(at driver4 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s8)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at truck8 s7)
	(empty truck8)
	(at package1 s7)
	(at package2 s4)
	(at package3 s3)
	(at package4 s5)
	(at package5 s6)
	(at package6 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 3)
	(= (time-to-walk p0-2 s0) 3)
	(= (time-to-walk s2 p0-2) 38)
	(= (time-to-walk p0-2 s2) 38)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 2)
	(= (time-to-walk p0-4 s0) 2)
	(= (time-to-walk s4 p0-4) 60)
	(= (time-to-walk p0-4 s4) 60)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 32)
	(= (time-to-walk p0-5 s0) 32)
	(= (time-to-walk s5 p0-5) 27)
	(= (time-to-walk p0-5 s5) 27)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 55)
	(= (time-to-walk p1-2 s1) 55)
	(= (time-to-walk s2 p1-2) 44)
	(= (time-to-walk p1-2 s2) 44)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 79)
	(= (time-to-walk p1-4 s1) 79)
	(= (time-to-walk s4 p1-4) 73)
	(= (time-to-walk p1-4 s4) 73)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 25)
	(= (time-to-walk p1-6 s1) 25)
	(= (time-to-walk s6 p1-6) 71)
	(= (time-to-walk p1-6 s6) 71)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 13)
	(= (time-to-walk p3-1 s3) 13)
	(= (time-to-walk s1 p3-1) 8)
	(= (time-to-walk p3-1 s1) 8)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 32)
	(= (time-to-walk p3-6 s3) 32)
	(= (time-to-walk s6 p3-6) 82)
	(= (time-to-walk p3-6 s6) 82)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 59)
	(= (time-to-walk p3-7 s3) 59)
	(= (time-to-walk s7 p3-7) 18)
	(= (time-to-walk p3-7 s7) 18)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 34)
	(= (time-to-walk p4-3 s4) 34)
	(= (time-to-walk s3 p4-3) 2)
	(= (time-to-walk p4-3 s3) 2)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 79)
	(= (time-to-walk p4-8 s4) 79)
	(= (time-to-walk s8 p4-8) 91)
	(= (time-to-walk p4-8 s8) 91)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 59)
	(= (time-to-walk p7-1 s7) 59)
	(= (time-to-walk s1 p7-1) 98)
	(= (time-to-walk p7-1 s1) 98)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 13)
	(= (time-to-walk p7-2 s7) 13)
	(= (time-to-walk s2 p7-2) 29)
	(= (time-to-walk p7-2 s2) 29)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 1)
	(= (time-to-walk p8-0 s8) 1)
	(= (time-to-walk s0 p8-0) 14)
	(= (time-to-walk p8-0 s0) 14)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 35)
	(= (time-to-walk p8-2 s8) 35)
	(= (time-to-walk s2 p8-2) 95)
	(= (time-to-walk p8-2 s2) 95)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 36)
	(= (time-to-walk p8-3 s8) 36)
	(= (time-to-walk s3 p8-3) 38)
	(= (time-to-walk p8-3 s3) 38)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 32)
	(= (time-to-walk p8-5 s8) 32)
	(= (time-to-walk s5 p8-5) 37)
	(= (time-to-walk p8-5 s5) 37)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 97)
	(= (time-to-drive s2 s0) 97)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 64)
	(= (time-to-drive s3 s1) 64)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 64)
	(= (time-to-drive s5 s1) 64)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 51)
	(= (time-to-drive s8 s1) 51)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 7)
	(= (time-to-drive s1 s2) 7)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 42)
	(= (time-to-drive s3 s2) 42)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 24)
	(= (time-to-drive s4 s2) 24)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 32)
	(= (time-to-drive s6 s2) 32)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 12)
	(= (time-to-drive s7 s2) 12)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 36)
	(= (time-to-drive s0 s3) 36)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 40)
	(= (time-to-drive s4 s3) 40)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 44)
	(= (time-to-drive s5 s4) 44)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 17)
	(= (time-to-drive s3 s5) 17)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 98)
	(= (time-to-drive s6 s5) 98)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 61)
	(= (time-to-drive s7 s5) 61)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 51)
	(= (time-to-drive s3 s6) 51)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 99)
	(= (time-to-drive s0 s7) 99)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 39)
	(= (time-to-drive s4 s7) 39)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 42)
	(= (time-to-drive s6 s7) 42)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 57)
	(= (time-to-drive s5 s8) 57)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 36)
	(= (time-to-drive s7 s8) 36)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s2)
	(at driver4 s7)
	(at truck3 s7)
	(at truck4 s1)
	(at truck5 s7)
	(at truck6 s2)
	(at truck8 s8)
	(at package1 s5)
	(at package2 s7)
	(at package3 s5)
	(at package4 s1)
	(at package6 s8)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (load-truck package3 truck5 s3)
   deleted: (at package3 s3)
   added: (in package3 truck5)
   goals met: 2 of 13
2. (board-truck driver3 truck1 s6)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 13
3. (walk driver4 s2 p7-2)
   deleted: (at driver4 s2)
   added: (at driver4 p7-2)
   changed: (walked) from 0 to 29
   goals met: 2 of 13
4. (unload-truck package3 truck5 s3)
   deleted: (in package3 truck5)
   added: (at package3 s3)
   goals met: 2 of 13
5. (walk driver2 s3 p8-3)
   deleted: (at driver2 s3)
   added: (at driver2 p8-3)
   changed: (walked) from 29 to 67
   goals met: 2 of 13
6. (drive-truck truck1 s6 s2 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 0 to 32
   goals met: 2 of 13
7. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 32 to 129
   goals met: 2 of 13
8. (load-truck package6 truck1 s0)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 2 of 13
9. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 129 to 226
   goals met: 2 of 13
10. (drive-truck truck1 s2 s4 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 226 to 250
   goals met: 2 of 13
11. (walk driver4 p7-2 s7)
   deleted: (at driver4 p7-2)
   added: (at driver4 s7)
   changed: (walked) from 67 to 80
   goals met: 3 of 13
12. (load-truck package1 truck8 s7)
   deleted: (at package1 s7)
   added: (in package1 truck8)
   goals met: 3 of 13
13. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 3 of 13
14. (board-truck driver4 truck8 s7)
   deleted: (at driver4 s7) (empty truck8)
   added: (driving driver4 truck8)
   goals met: 2 of 13
15. (drive-truck truck8 s7 s5 driver4)
   deleted: (at truck8 s7)
   added: (at truck8 s5)
   changed: (driven) from 250 to 311
   goals met: 2 of 13
16. (unload-truck package1 truck8 s5)
   deleted: (in package1 truck8)
   added: (at package1 s5)
   goals met: 3 of 13
17. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 311 to 335
   goals met: 3 of 13
18. (load-truck package4 truck8 s5)
   deleted: (at package4 s5)
   added: (in package4 truck8)
   goals met: 3 of 13
19. (drive-truck truck8 s5 s8 driver4)
   deleted: (at truck8 s5)
   added: (at truck8 s8)
   changed: (driven) from 335 to 392
   goals met: 4 of 13
20. (walk driver2 p8-3 s3)
   deleted: (at driver2 p8-3)
   added: (at driver2 s3)
   changed: (walked) from 80 to 118
   goals met: 4 of 13
21. (disembark-truck driver4 truck8 s8)
   deleted: (driving driver4 truck8)
   added: (at driver4 s8) (empty truck8)
   goals met: 4 of 13
22. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 5 of 13
23. (load-truck package3 truck5 s3)
   deleted: (at package3 s3)
   added: (in package3 truck5)
   goals met: 5 of 13
24. (board-truck driver4 truck6 s8)
   deleted: (at driver4 s8) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 5 of 13
25. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 4 of 13
26. (unload-truck package4 truck8 s8)
   deleted: (in package4 truck8)
   added: (at package4 s8)
   goals met: 4 of 13
27. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 4 of 13
28. (drive-truck truck5 s3 s5 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   changed: (driven) from 392 to 409
   goals met: 4 of 13
29. (unload-truck package3 truck5 s5)
   deleted: (in package3 truck5)
   added: (at package3 s5)
   goals met: 5 of 13
30. (load-truck package4 truck6 s8)
   deleted: (at package4 s8)
   added: (in package4 truck6)
   goals met: 5 of 13
31. (drive-truck truck5 s5 s7 driver2)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   changed: (driven) from 409 to 470
   goals met: 6 of 13
32. (drive-truck truck1 s2 s7 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (driven) from 470 to 482
   goals met: 6 of 13
33. (unload-truck package2 truck1 s7)
   deleted: (in package2 truck1)
   added: (at package2 s7)
   goals met: 7 of 13
34. (drive-truck truck1 s7 s8 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s8)
   changed: (driven) from 482 to 518
   goals met: 7 of 13
35. (unload-truck package6 truck1 s8)
   deleted: (in package6 truck1)
   added: (at package6 s8)
   goals met: 8 of 13
36. (disembark-truck driver3 truck1 s8)
   deleted: (driving driver3 truck1)
   added: (at driver3 s8) (empty truck1)
   goals met: 8 of 13
37. (drive-truck truck6 s8 s1 driver4)
   deleted: (at truck6 s8)
   added: (at truck6 s1)
   changed: (driven) from 518 to 569
   goals met: 8 of 13
38. (unload-truck package4 truck6 s1)
   deleted: (in package4 truck6)
   added: (at package4 s1)
   goals met: 9 of 13
39. (drive-truck truck6 s1 s2 driver4)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   changed: (driven) from 569 to 576
   goals met: 10 of 13
40. (drive-truck truck6 s2 s7 driver4)
   deleted: (at truck6 s2)
   added: (at truck6 s7)
   changed: (driven) from 576 to 588
   goals met: 9 of 13
41. (board-truck driver3 truck4 s8)
   deleted: (at driver3 s8) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 13
42. (drive-truck truck6 s7 s8 driver4)
   deleted: (at truck6 s7)
   added: (at truck6 s8)
   changed: (driven) from 588 to 624
   goals met: 9 of 13
43. (drive-truck truck4 s8 s1 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   changed: (driven) from 624 to 675
   goals met: 10 of 13
44. (drive-truck truck4 s1 s2 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (driven) from 675 to 682
   goals met: 9 of 13
45. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 10 of 13
46. (board-truck driver1 truck4 s2)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 9 of 13
47. (drive-truck truck4 s2 s1 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 682 to 689
   goals met: 10 of 13
48. (drive-truck truck6 s8 s1 driver4)
   deleted: (at truck6 s8)
   added: (at truck6 s1)
   changed: (driven) from 689 to 740
   goals met: 10 of 13
49. (disembark-truck driver4 truck6 s1)
   deleted: (driving driver4 truck6)
   added: (at driver4 s1) (empty truck6)
   goals met: 10 of 13
50. (walk driver4 s1 p7-1)
   deleted: (at driver4 s1)
   added: (at driver4 p7-1)
   changed: (walked) from 118 to 216
   goals met: 10 of 13
51. (walk driver4 p7-1 s7)
   deleted: (at driver4 p7-1)
   added: (at driver4 s7)
   changed: (walked) from 216 to 275
   goals met: 11 of 13
52. (disembark-truck driver1 truck4 s1)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 11 of 13
53. (board-truck driver1 truck6 s1)
   deleted: (at driver1 s1) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 11 of 13
54. (drive-truck truck6 s1 s2 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   changed: (driven) from 740 to 747
   goals met: 12 of 13
55. (disembark-truck driver1 truck6 s2)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 13 of 13
